app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sunil"], ["email", "mandiwalsunil91@gmail.com"], ["created_at", 2016-10-14 11:49:45 UTC], ["updated_at", 2016-10-14 11:49:45 UTC]]